Revit 2017 API
AssetPropertyDoubleMatrix44 Class
 Represents a property consisting of an array of double values.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public class AssetPropertyDoubleMatrix44 : AssetProperty
Visual Basic
Public Class AssetPropertyDoubleMatrix44 _
	Inherits AssetProperty
Visual C++
public ref class AssetPropertyDoubleMatrix44 : public AssetProperty
Remarks
 In virtually all cases, the array will contain exactly 16 values. It represents a 4x4 matrix.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.Utility.AssetProperty
 Autodesk.Revit.Utility.AssetPropertyDoubleMatrix44
See Also
AssetPropertyDoubleMatrix44 Members
Autodesk.Revit.Utility Namespace